In [1]:
@article{yu2018spider,
  title={Spider: A large-scale human-labeled dataset for complex and cross-domain semantic parsing and text-to-sql task},
  author={Yu, Tao and Zhang, Rui and Yang, Kai and Yasunaga, Michihiro and Wang, Dongxu and Li, Zifan and Ma, James and Li, Irene and Yao, Qingning and Roman, Shanelle and others},
  journal={arXiv preprint arXiv:1809.08887},
  year={2018}
} 


#df = pd.read_json("hf://datasets/richardr1126/spider-natsql-context-validation/validation.json")

C:\Users\altha\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [3]:
import pandas as pd

df_raw=pd.read_csv("../dataset.csv")
df_raw.head()

,db_id,prompt,ground_truth
0,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer
1,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer
2,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A..."
3,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A..."
4,concert_singer,"Below is an instruction that describes a task,...","select avg ( singer.Age ) , min ( singer.Age ..."

In [4]:
df_raw["Question"]=df_raw["prompt"].apply(lambda x : x.split("Convert text to NatSQL: ")[1].split("|")[0].strip())

In [27]:
df_raw.head()

,db_id,prompt,ground_truth,Question
0,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer,How many singers do we have?
1,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer,What is the total number of singers?
2,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A...","Show name, country, age for all singers ordere..."
3,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A...","What are the names, countries, and ages for ev..."
4,concert_singer,"Below is an instruction that describes a task,...","select avg ( singer.Age ) , min ( singer.Age ...","What is the average, minimum, and maximum age ..."

In [11]:
for i, row in df_raw.head(10).iterrows():
    original_nl = row['Question']
    gt_sql = row['ground_truth']
    db_id = row['db_id']
    print(original_nl)
    print(gt_sql)
    print(db_id)

How many singers do we have?
select count ( singer.* )  from singer
concert_singer
What is the total number of singers?
select count ( singer.* )  from singer
concert_singer
Show name, country, age for all singers ordered by age from the oldest to the youngest.
select singer.Name , singer.Country , singer.Age from singer  order by singer.Age desc
concert_singer
What are the names, countries, and ages for every singer in descending order of age?
select singer.Name , singer.Country , singer.Age from singer  order by singer.Age desc
concert_singer
What is the average, minimum, and maximum age of all singers from France?
select avg ( singer.Age )  , min ( singer.Age )  , max ( singer.Age )  from singer  where  singer.Country = "France"
concert_singer
What is the average, minimum, and maximum age for all French singers?
select avg ( singer.Age )  , min ( singer.Age )  , max ( singer.Age )  from singer  where  singer.Country = "France"
concert_singer
Show the name and the release year of the song by the youngest singer.
select singer.Song_Name , singer.Song_release_year from singer  order by singer.Age asc limit 1
concert_singer
What are the names and release years for all the songs of the youngest singer?
select singer.Song_Name , singer.Song_release_year from singer  order by singer.Age asc limit 1
concert_singer
What are all distinct countries where singers above age 20 are from?
select  distinct singer.Country from singer  where  singer.Age > 20
concert_singer
What are  the different countries with singers above age 20?
select  distinct singer.Country from singer  where  singer.Age > 20
concert_singer

In [17]:
runnable_sql=pd.read_csv("../dataset/runnable_sql.csv",names=["First","Second"])
runnable_sql.head()

                                               First          Second
0                                              Query             NaN
1                        SELECT count(*) FROM singer  concert_singer
2                        SELECT count(*) FROM singer  concert_singer
3  SELECT name ,  country ,  age FROM singer ORDE...  concert_singer
4  SELECT name ,  country ,  age FROM singer ORDE...  concert_singer

In [20]:
new_df=pd.DataFrame(runnable_sql["First"]+runnable_sql["Second"])
new_df.head()

                                                   0
0                                                NaN
1          SELECT count(*) FROM singerconcert_singer
2          SELECT count(*) FROM singerconcert_singer
3  SELECT name ,  country ,  age FROM singer ORDE...
4  SELECT name ,  country ,  age FROM singer ORDE...

In [21]:
new_df.to_csv("runnable_sql.csv",index=False)

In [34]:
runnable_sql=pd.read_csv("../dataset/runnable_sql.csv",header=None,names=["query"])
runnable_sql.head()

                                               query
0          SELECT count(*) FROM singerconcert_singer
1          SELECT count(*) FROM singerconcert_singer
2  SELECT name ,  country ,  age FROM singer ORDE...
3  SELECT name ,  country ,  age FROM singer ORDE...
4  SELECT avg(age) ,  min(age) ,  max(age) FROM s...

In [26]:
runnable_sql.to_csv("runnable_sql.csv")

In [35]:
df_raw=pd.read_csv("../dataset/dataset.csv")
df_raw.head()

,db_id,prompt,ground_truth
0,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer
1,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer
2,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A..."
3,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A..."
4,concert_singer,"Below is an instruction that describes a task,...","select avg ( singer.Age ) , min ( singer.Age ..."

In [36]:
df_raw["runnable_sql"]=runnable_sql["query"]
df_raw.head()

,db_id,prompt,ground_truth,runnable_sql
0,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer,SELECT count(*) FROM singerconcert_singer
1,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer,SELECT count(*) FROM singerconcert_singer
2,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A...","SELECT name , country , age FROM singer ORDE..."
3,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A...","SELECT name , country , age FROM singer ORDE..."
4,concert_singer,"Below is an instruction that describes a task,...","select avg ( singer.Age ) , min ( singer.Age ...","SELECT avg(age) , min(age) , max(age) FROM s..."

In [41]:
df1=pd.read_csv("runnable_sql.csv",header=None,names=["first","second"])
df1["query"]=df1["first"]+df1["second"].apply(lambda x: " " + x if not x.startswith(" ") else x)
df1.head()

,first,second,query
0,SELECT count(*) FROM singer,concert_singer,SELECT count(*) FROM singer concert_singer
1,SELECT count(*) FROM singer,concert_singer,SELECT count(*) FROM singer concert_singer
2,"SELECT name , country , age FROM singer ORDE...",concert_singer,"SELECT name , country , age FROM singer ORDE..."
3,"SELECT name , country , age FROM singer ORDE...",concert_singer,"SELECT name , country , age FROM singer ORDE..."
4,"SELECT avg(age) , min(age) , max(age) FROM s...",concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s..."

In [42]:
df1.drop(columns=["first","second"],inplace=True)
df1.to_csv("runnable_sql.csv",index=False)

In [48]:
df2=pd.read_csv("runnable_sql.csv")
df2["query"]

0              SELECT count(*) FROM singer concert_singer
1              SELECT count(*) FROM singer concert_singer
2       SELECT name ,  country ,  age FROM singer ORDE...
3       SELECT name ,  country ,  age FROM singer ORDE...
4       SELECT avg(age) ,  min(age) ,  max(age) FROM s...
                              ...
1029    SELECT Citizenship FROM singer WHERE Birth_Yea...
1030    SELECT count(*) FROM Other_Available_Features ...
1031    SELECT T2.feature_type_name FROM Other_Availab...
1032    SELECT T2.property_type_description FROM Prope...
1033    SELECT property_name FROM Properties WHERE pro...
Name: query, Length: 1034, dtype: object

In [50]:
dff=pd.read_csv("runnable_sql.csv",header=None,names=["query","db"])
dff.head()

                                               query              db
0                        SELECT count(*) FROM singer  concert_singer
1                        SELECT count(*) FROM singer  concert_singer
2  SELECT name ,  country ,  age FROM singer ORDE...  concert_singer
3  SELECT name ,  country ,  age FROM singer ORDE...  concert_singer
4  SELECT avg(age) ,  min(age) ,  max(age) FROM s...  concert_singer

In [51]:
dff["query"][0]

'SELECT count(*) FROM singer'

In [7]:
import pandas as pd
result_df=pd.read_csv("../results.csv")
result_df.head()

,original_nl,paraphrased_nl,gt_nl,generated_sql,matched
0,How many singers do we have?,What is the count of all singers?,SELECT count(*) FROM singer,SELECT COUNT(*) AS singer_count FROM singer;,True
1,What is the total number of singers?,What is the overall count of singers?,SELECT count(*) FROM singer,SELECT COUNT(*) AS overall_count_of_singers FR...,True
2,"Show name, country, age for all singers ordere...","What singers are being displayed, where they a...","SELECT name , country , age FROM singer ORDE...","SELECT s.name AS singer_name, s.country AS sin...",False
3,"What are the names, countries, and ages for ev...","What are the singer's name, country, and age f...","SELECT name , country , age FROM singer ORDE...","SELECT name , country , age FROM singer ORDER ...",True
4,"What is the average, minimum, and maximum age ...","What are the mean, lowest, and highest ages of...","SELECT avg(age) , min(age) , max(age) FROM s...","SELECT AVG(age) AS mean_age, MIN(age) AS lowes...",True

In [8]:
false_df=result_df[result_df["matched"]==False]
false_df.head()

,original_nl,paraphrased_nl,gt_nl,generated_sql,matched
2,"Show name, country, age for all singers ordere...","What singers are being displayed, where they a...","SELECT name , country , age FROM singer ORDE...","SELECT s.name AS singer_name, s.country AS sin...",False
11,How many singers are from each country?,What is the count of distinct countries for ea...,"SELECT country , count(*) FROM singer GROUP B...","SELECT s.singer_id, COUNT(DISTINCT s.country) ...",False
26,Which year has most number of concerts?,What is the year with the highest count of con...,SELECT YEAR FROM concert GROUP BY YEAR ORDER B...,"SELECT concert.year, COUNT(concert.concert_id)...",False
27,What is the year that had the most concerts?,What is the year that had the highest number o...,SELECT YEAR FROM concert GROUP BY YEAR ORDER B...,"SELECT concert.year, COUNT(concert.concert_id)...",False
30,Show countries where a singer above age 40 and...,What countries are represented by singers who ...,SELECT country FROM singer WHERE age > 40 IN...,SELECT DISTINCT s.country FROM singer s WHERE ...,False

In [10]:
n=2
print(false_df.iloc[n]["original_nl"])
print(false_df.iloc[n]["paraphrased_nl"])
print(false_df.iloc[n]["gt_nl"])
print(false_df.iloc[n]["generated_sql"])

Which year has most number of concerts?
What is the year with the highest count of concerts?
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
SELECT concert.year, COUNT(concert.concert_id) AS concert_count FROM concert GROUP BY concert.year ORDER BY concert_count DESC LIMIT 1;

In [ ]:
print(false_df.iloc[n]["gt_nl"])
print(false_df.iloc[n]["generated_sql"])

"SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'"

In [5]:
false_df.iloc[14]["generated_sql"]

"SELECT s.name FROM singer s JOIN singer_in_concert sic ON s.singer_id = sic.singer_id JOIN concert c ON sic.concert_id = c.concert_id WHERE s.song_name LIKE '%Hey%'"

In [9]:
import numpy as np
import pandas as pd
a1=np.array([["25" , "Ak" , 34.5]])
a2=np.array([[34.5, 25. , "Ak" ]])
print(sorted(a1)[0])
print(sorted(a2)[0])

['25' 'Ak' '34.5']
['34.5' '25.0' 'Ak']

In [5]:
a_str = sorted(["|".join(map(str, map(lambda x: '' if pd.isna(x) else x, row))) for row in a1])
b_str = sorted(["|".join(map(str, map(lambda x: '' if pd.isna(x) else x, row))) for row in a2])

In [10]:
print(a_str)
print(b_str)

['25.0|43.0|34.5']
['34.5|25.0|43.0']

In [14]:
print(np.sort(b_str))

['34.5|25.0|43.0']

In [ ]:
arr1 = pd.DataFrame([["Country", "Count"],
    ['France', 4],
                ['Netherlands', 1],
                ['United States', 1]])
arr2=pd.DataFrame([["Country", "Count"],
    ['Netherlands', 1],
                ['United States', 1],
                ['France', 4],],headers=None)


print(arr1)
print(arr2)

TypeError: DataFrame.__init__() got an unexpected keyword argument 'headers'

In [1]:
import pandas as pd
df = pd.read_csv("../outputs/output_paraphrased.csv")
df_runnable_sql = pd.read_csv("../dataset/runnable_sql.csv", header=None, names=["gt_nl", "db_id"])
df["gt_nl"] = df_runnable_sql["gt_nl"]
df.head()

,db_id,prompt,ground_truth,Question,paraphrased_nl,gt_nl
0,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer,How many singers do we have?,What is the total count of singers in the data...,SELECT count(*) FROM singer
1,concert_singer,"Below is an instruction that describes a task,...",select count ( singer.* ) from singer,What is the total number of singers?,What is the overall count of singers in the da...,SELECT count(*) FROM singer
2,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A...","Show name, country, age for all singers ordere...","What are the names, countries of origin, and a...","SELECT name , country , age FROM singer ORDE..."
3,concert_singer,"Below is an instruction that describes a task,...","select singer.Name , singer.Country , singer.A...","What are the names, countries, and ages for ev...","What are the singer's names, countries, and ag...","SELECT name , country , age FROM singer ORDE..."
4,concert_singer,"Below is an instruction that describes a task,...","select avg ( singer.Age ) , min ( singer.Age ...","What is the average, minimum, and maximum age ...","What are the mean, lowest, and highest ages of...","SELECT avg(age) , min(age) , max(age) FROM s..."